app/views/photos/show.html.erb


<% @photo.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."photo_id" = ?  [["photo_id", 5]]

<p>comments</p>
<% @photo.comments.each do |co| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  [["photo_id", 4]]