app/controllers/comments_controller.rb

  def create
    @comment = @photo.comments.build(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "photo_id", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "asdasdasd"], ["created_at", "2014-11-06 15:38:07.051418"], ["photo_id", 4], ["updated_at", "2014-11-06 15:38:07.051418"]]

  def find_photo
    @photo = Photo.find(params[:photo_id])
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 5]]

  def find_params
    @comment = @photo.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."photo_id" = ? AND "comments"."id" = ? LIMIT 1  [["photo_id", 5], ["id", 3]]