app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-12 09:23:24.945225"], ["friend_id", 2], ["updated_at", "2014-11-12 09:23:24.945225"], ["user_id", 1]]
---
  def create
    @friendship = current_user.friendships.create( :friend_id => params[:friend_id] )