app/controllers/photos_controller.rb

INSERT INTO "photos" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "photos" SET "updated_at" = ?, "user_id" = ? WHERE "photos"."id" = 9  [["updated_at", "2014-11-13 04:03:34.338340"], ["user_id", 1]]
---
  def create
    @photo = Photo.create(photo_params)
    @photo.user = current_user

    if @photo.save

UPDATE "photos" SET "title" = ?, "updated_at" = ? WHERE "photos"."id" = 4  [["title", "qweqwe"], ["updated_at", "2014-11-06 14:24:47.300652"]]
---
  def update
    if @photo.update(photo_params)

INSERT INTO "likes" ("created_at", "photo_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-07 11:00:39.722286"], ["photo_id", 6], ["updated_at", "2014-11-07 11:00:39.722286"], ["user_id", 2]]
---
  def like
    like = @photo.likes.build
    like.user = current_user
    like.save

SELECT  "likes".* FROM "likes"  WHERE "likes"."photo_id" = ? AND "likes"."user_id" = 2  ORDER BY "likes"."id" ASC LIMIT 1  [["photo_id", 6]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 16]]
---
  def unlike
    like = @photo.find_user_like(current_user)
    like.destroy

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 6]]
---
  def find_photo
    @photo = Photo.find(params[:id])