app/controllers/users_controller.rb

INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-12 12:28:45.632934"], ["friend_id", 2], ["updated_at", "2014-11-12 12:28:45.632934"], ["user_id", 1]]
---
  def addfriend
    @friend = current_user.friendships.create(:friend_id => params[:id])

SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."user_id" = ? AND (friend_id=NULL)  ORDER BY "friendships"."id" ASC LIMIT 1  [["user_id", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 5]]
---
  def unfriend
    @friend = current_user.friendships.where('friend_id=?', params[:id]).first
    @friend.destroy