app/controllers/users_controller.rb

  def addfriend
    @friend = User.find(params[:friend_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def unfriend
    @friend = User.find(params[:friend_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]